***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    MFS Source for COACTUP - Account Update Screen
*    Converted from BMS: app/bms/COACTUP.bms
***********************************************************************
         PRINT NOGEN
COACTUP  FMT   DEV(TYPE=3270,FEAT=IGNORE,DSCA=X'00A0')
         DIV   TYPE=INOUT
         DPAGE FILL=PT,CURSOR=((6,21))
***********************************************************************
*    Header Fields
***********************************************************************
         DFLD  'Tran:',POS=(1,1),LTH=5,ATTR=(PROT,NUM)
TRNNAME  DFLD  POS=(1,7),LTH=4,ATTR=(PROT,NUM)
TITLE01  DFLD  POS=(1,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Date:',POS=(1,65),LTH=5,ATTR=(PROT,NUM)
CURDATE  DFLD  POS=(1,71),LTH=8,ATTR=(PROT,NUM)
         DFLD  'Prog:',POS=(2,1),LTH=5,ATTR=(PROT,NUM)
PGMNAME  DFLD  POS=(2,7),LTH=8,ATTR=(PROT,NUM)
TITLE02  DFLD  POS=(2,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Time:',POS=(2,65),LTH=5,ATTR=(PROT,NUM)
CURTIME  DFLD  POS=(2,71),LTH=8,ATTR=(PROT,NUM)
***********************************************************************
*    Account Update Body
***********************************************************************
         DFLD  'Account Update',POS=(4,33),LTH=14,ATTR=(PROT,HI)
         DFLD  'Account Number:',POS=(6,5),LTH=15,ATTR=(PROT,NUM)
ACCTSID  DFLD  POS=(6,21),LTH=11,ATTR=(MOD,NUM)
         DFLD  'Account Status:',POS=(8,5),LTH=15,ATTR=(PROT,NUM)
ACSTTUS  DFLD  POS=(8,21),LTH=1,ATTR=(MOD,NUM)
         DFLD  'Date Opened:',POS=(8,30),LTH=12,ATTR=(PROT,NUM)
ADTOYR   DFLD  POS=(8,43),LTH=4,ATTR=(MOD,NUM)
         DFLD  '-',POS=(8,48),LTH=1,ATTR=(PROT,NUM)
ADTOMON  DFLD  POS=(8,50),LTH=2,ATTR=(MOD,NUM)
         DFLD  '-',POS=(8,53),LTH=1,ATTR=(PROT,NUM)
ADTODAY  DFLD  POS=(8,55),LTH=2,ATTR=(MOD,NUM)
         DFLD  'Expiry Date:',POS=(8,60),LTH=12,ATTR=(PROT,NUM)
AEXPYR   DFLD  POS=(8,73),LTH=4,ATTR=(MOD,NUM)
         DFLD  '-',POS=(9,5),LTH=1,ATTR=(PROT,NUM)
AEXPMON  DFLD  POS=(9,7),LTH=2,ATTR=(MOD,NUM)
         DFLD  '-',POS=(9,10),LTH=1,ATTR=(PROT,NUM)
AEXPDAY  DFLD  POS=(9,12),LTH=2,ATTR=(MOD,NUM)
         DFLD  'Credit Limit:',POS=(10,5),LTH=13,ATTR=(PROT,NUM)
ACRDLIM  DFLD  POS=(10,19),LTH=15,ATTR=(MOD,NUM)
         DFLD  'Cash Limit:',POS=(10,37),LTH=11,ATTR=(PROT,NUM)
ACSHLIM  DFLD  POS=(10,49),LTH=15,ATTR=(MOD,NUM)
         DFLD  'Reissue Date:',POS=(12,5),LTH=13,ATTR=(PROT,NUM)
AREISYR  DFLD  POS=(12,19),LTH=4,ATTR=(MOD,NUM)
         DFLD  '-',POS=(12,24),LTH=1,ATTR=(PROT,NUM)
AREISMON DFLD  POS=(12,26),LTH=2,ATTR=(MOD,NUM)
         DFLD  '-',POS=(12,29),LTH=1,ATTR=(PROT,NUM)
AREISDAY DFLD  POS=(12,31),LTH=2,ATTR=(MOD,NUM)
         DFLD  'Current Balance:',POS=(12,36),LTH=16,ATTR=(PROT,NUM)
ACURBAL  DFLD  POS=(12,53),LTH=15,ATTR=(PROT,NUM)
         DFLD  'Current Cycle Credit:',POS=(14,5),LTH=21, X
               ATTR=(PROT,NUM)
ACRCYCR  DFLD  POS=(14,27),LTH=15,ATTR=(PROT,NUM)
         DFLD  'Current Cycle Debit:',POS=(14,45),LTH=20, X
               ATTR=(PROT,NUM)
ACRCYDB  DFLD  POS=(14,66),LTH=15,ATTR=(PROT,NUM)
***********************************************************************
*    Customer Information Section
***********************************************************************
         DFLD  'Customer Information',POS=(16,30),LTH=20, X
               ATTR=(PROT,HI)
         DFLD  'First Name:',POS=(17,5),LTH=11,ATTR=(PROT,NUM)
CFNAME   DFLD  POS=(17,17),LTH=25,ATTR=(MOD,NUM)
         DFLD  'Middle:',POS=(17,45),LTH=7,ATTR=(PROT,NUM)
CMNAME   DFLD  POS=(17,53),LTH=25,ATTR=(MOD,NUM)
         DFLD  'Last Name:',POS=(18,5),LTH=10,ATTR=(PROT,NUM)
CLNAME   DFLD  POS=(18,16),LTH=25,ATTR=(MOD,NUM)
         DFLD  'SSN:',POS=(18,44),LTH=4,ATTR=(PROT,NUM)
ACTSSN1  DFLD  POS=(18,49),LTH=3,ATTR=(MOD,NUM)
         DFLD  '-',POS=(18,53),LTH=1,ATTR=(PROT,NUM)
ACTSSN2  DFLD  POS=(18,55),LTH=2,ATTR=(MOD,NUM)
         DFLD  '-',POS=(18,58),LTH=1,ATTR=(PROT,NUM)
ACTSSN3  DFLD  POS=(18,60),LTH=4,ATTR=(MOD,NUM)
         DFLD  'DOB:',POS=(19,5),LTH=4,ATTR=(PROT,NUM)
CDOBYR   DFLD  POS=(19,10),LTH=4,ATTR=(MOD,NUM)
         DFLD  '-',POS=(19,15),LTH=1,ATTR=(PROT,NUM)
CDOBMON  DFLD  POS=(19,17),LTH=2,ATTR=(MOD,NUM)
         DFLD  '-',POS=(19,20),LTH=1,ATTR=(PROT,NUM)
CDOBDAY  DFLD  POS=(19,22),LTH=2,ATTR=(MOD,NUM)
         DFLD  'FICO:',POS=(19,27),LTH=5,ATTR=(PROT,NUM)
CFICO    DFLD  POS=(19,33),LTH=3,ATTR=(MOD,NUM)
         DFLD  'Address:',POS=(20,5),LTH=8,ATTR=(PROT,NUM)
CADDR1   DFLD  POS=(20,14),LTH=25,ATTR=(MOD,NUM)
CADDR2   DFLD  POS=(20,40),LTH=25,ATTR=(MOD,NUM)
         DFLD  'City:',POS=(21,5),LTH=5,ATTR=(PROT,NUM)
CCITY    DFLD  POS=(21,11),LTH=25,ATTR=(MOD,NUM)
         DFLD  'State:',POS=(21,39),LTH=6,ATTR=(PROT,NUM)
CSTATE   DFLD  POS=(21,46),LTH=2,ATTR=(MOD,NUM)
         DFLD  'Zip:',POS=(21,51),LTH=4,ATTR=(PROT,NUM)
CZIP     DFLD  POS=(21,56),LTH=10,ATTR=(MOD,NUM)
         DFLD  'Phone:',POS=(21,69),LTH=6,ATTR=(PROT,NUM)
CPHONE   DFLD  POS=(22,5),LTH=15,ATTR=(MOD,NUM)
ERRMSG   DFLD  POS=(23,1),LTH=78,ATTR=(PROT,MOD)
         DFLD  'ENTER=Continue  F3=Back  F4=Clear  F5=Update', X
               POS=(24,1),LTH=44,ATTR=(PROT,NUM)
         FMTEND
***********************************************************************
*    MOD - Message Output Descriptor
***********************************************************************
CACTUPMO MSG   TYPE=OUTPUT,SOR=(COACTUP,IGNORE),NXT=CACTUPMI
         SEG
         MFLD  TRNNAME,LTH=4
         MFLD  TITLE01,LTH=40
         MFLD  CURDATE,LTH=8
         MFLD  PGMNAME,LTH=8
         MFLD  TITLE02,LTH=40
         MFLD  CURTIME,LTH=8
         MFLD  ACCTSID,LTH=11
         MFLD  ACSTTUS,LTH=1
         MFLD  ADTOYR,LTH=4
         MFLD  ADTOMON,LTH=2
         MFLD  ADTODAY,LTH=2
         MFLD  AEXPYR,LTH=4
         MFLD  AEXPMON,LTH=2
         MFLD  AEXPDAY,LTH=2
         MFLD  ACRDLIM,LTH=15
         MFLD  ACSHLIM,LTH=15
         MFLD  AREISYR,LTH=4
         MFLD  AREISMON,LTH=2
         MFLD  AREISDAY,LTH=2
         MFLD  ACURBAL,LTH=15
         MFLD  ACRCYCR,LTH=15
         MFLD  ACRCYDB,LTH=15
         MFLD  CFNAME,LTH=25
         MFLD  CMNAME,LTH=25
         MFLD  CLNAME,LTH=25
         MFLD  ACTSSN1,LTH=3
         MFLD  ACTSSN2,LTH=2
         MFLD  ACTSSN3,LTH=4
         MFLD  CDOBYR,LTH=4
         MFLD  CDOBMON,LTH=2
         MFLD  CDOBDAY,LTH=2
         MFLD  CFICO,LTH=3
         MFLD  CADDR1,LTH=25
         MFLD  CADDR2,LTH=25
         MFLD  CCITY,LTH=25
         MFLD  CSTATE,LTH=2
         MFLD  CZIP,LTH=10
         MFLD  CPHONE,LTH=15
         MFLD  ERRMSG,LTH=78
         MSGEND
***********************************************************************
*    MID - Message Input Descriptor
***********************************************************************
CACTUPMI MSG   TYPE=INPUT,SOR=(COACTUP,IGNORE),NXT=CACTUPMO
         SEG
         MFLD  ACCTSID,LTH=11,FILL=NULL
         MFLD  ACSTTUS,LTH=1,FILL=NULL
         MFLD  ADTOYR,LTH=4,FILL=NULL
         MFLD  ADTOMON,LTH=2,FILL=NULL
         MFLD  ADTODAY,LTH=2,FILL=NULL
         MFLD  AEXPYR,LTH=4,FILL=NULL
         MFLD  AEXPMON,LTH=2,FILL=NULL
         MFLD  AEXPDAY,LTH=2,FILL=NULL
         MFLD  ACRDLIM,LTH=15,FILL=NULL
         MFLD  ACSHLIM,LTH=15,FILL=NULL
         MFLD  AREISYR,LTH=4,FILL=NULL
         MFLD  AREISMON,LTH=2,FILL=NULL
         MFLD  AREISDAY,LTH=2,FILL=NULL
         MFLD  CFNAME,LTH=25,FILL=NULL
         MFLD  CMNAME,LTH=25,FILL=NULL
         MFLD  CLNAME,LTH=25,FILL=NULL
         MFLD  ACTSSN1,LTH=3,FILL=NULL
         MFLD  ACTSSN2,LTH=2,FILL=NULL
         MFLD  ACTSSN3,LTH=4,FILL=NULL
         MFLD  CDOBYR,LTH=4,FILL=NULL
         MFLD  CDOBMON,LTH=2,FILL=NULL
         MFLD  CDOBDAY,LTH=2,FILL=NULL
         MFLD  CFICO,LTH=3,FILL=NULL
         MFLD  CADDR1,LTH=25,FILL=NULL
         MFLD  CADDR2,LTH=25,FILL=NULL
         MFLD  CCITY,LTH=25,FILL=NULL
         MFLD  CSTATE,LTH=2,FILL=NULL
         MFLD  CZIP,LTH=10,FILL=NULL
         MFLD  CPHONE,LTH=15,FILL=NULL
         MSGEND
         END
