***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    MFS Source for COACTVW - Account View Screen
*    Converted from BMS: app/bms/COACTVW.bms
***********************************************************************
         PRINT NOGEN
COACTVW  FMT   DEV(TYPE=3270,FEAT=IGNORE,DSCA=X'00A0')
         DIV   TYPE=INOUT
         DPAGE FILL=PT,CURSOR=((6,21))
***********************************************************************
*    Header Fields
***********************************************************************
         DFLD  'Tran:',POS=(1,1),LTH=5,ATTR=(PROT,NUM)
TRNNAME  DFLD  POS=(1,7),LTH=4,ATTR=(PROT,NUM)
TITLE01  DFLD  POS=(1,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Date:',POS=(1,65),LTH=5,ATTR=(PROT,NUM)
CURDATE  DFLD  POS=(1,71),LTH=8,ATTR=(PROT,NUM)
         DFLD  'Prog:',POS=(2,1),LTH=5,ATTR=(PROT,NUM)
PGMNAME  DFLD  POS=(2,7),LTH=8,ATTR=(PROT,NUM)
TITLE02  DFLD  POS=(2,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Time:',POS=(2,65),LTH=5,ATTR=(PROT,NUM)
CURTIME  DFLD  POS=(2,71),LTH=8,ATTR=(PROT,NUM)
***********************************************************************
*    Account View Body
***********************************************************************
         DFLD  'Account View',POS=(4,34),LTH=12,ATTR=(PROT,HI)
         DFLD  'Account Number:',POS=(6,5),LTH=15,ATTR=(PROT,NUM)
ACCTSID  DFLD  POS=(6,21),LTH=11,ATTR=(MOD,NUM)
         DFLD  'Account Status:',POS=(8,5),LTH=15,ATTR=(PROT,NUM)
ACSTTUS  DFLD  POS=(8,21),LTH=1,ATTR=(PROT,NUM)
         DFLD  'Date Opened:',POS=(8,30),LTH=12,ATTR=(PROT,NUM)
ADTOPEN  DFLD  POS=(8,43),LTH=10,ATTR=(PROT,NUM)
         DFLD  'Expiry Date:',POS=(8,56),LTH=12,ATTR=(PROT,NUM)
AEXPDT   DFLD  POS=(8,69),LTH=10,ATTR=(PROT,NUM)
         DFLD  'Credit Limit:',POS=(10,5),LTH=13,ATTR=(PROT,NUM)
ACRDLIM  DFLD  POS=(10,19),LTH=15,ATTR=(PROT,NUM)
         DFLD  'Cash Limit:',POS=(10,37),LTH=11,ATTR=(PROT,NUM)
ACSHLIM  DFLD  POS=(10,49),LTH=15,ATTR=(PROT,NUM)
         DFLD  'Reissue Date:',POS=(12,5),LTH=13,ATTR=(PROT,NUM)
AREISDT  DFLD  POS=(12,19),LTH=10,ATTR=(PROT,NUM)
         DFLD  'Current Balance:',POS=(12,32),LTH=16,ATTR=(PROT,NUM)
ACURBAL  DFLD  POS=(12,49),LTH=15,ATTR=(PROT,NUM)
         DFLD  'Current Cycle Credit:',POS=(14,5),LTH=21, X
               ATTR=(PROT,NUM)
ACRCYCR  DFLD  POS=(14,27),LTH=15,ATTR=(PROT,NUM)
         DFLD  'Current Cycle Debit:',POS=(14,45),LTH=20, X
               ATTR=(PROT,NUM)
ACRCYDB  DFLD  POS=(14,66),LTH=15,ATTR=(PROT,NUM)
***********************************************************************
*    Customer Information Section
***********************************************************************
         DFLD  'Customer Information',POS=(16,30),LTH=20, X
               ATTR=(PROT,HI)
         DFLD  'First Name:',POS=(17,5),LTH=11,ATTR=(PROT,NUM)
CFNAME   DFLD  POS=(17,17),LTH=25,ATTR=(PROT,NUM)
         DFLD  'Middle:',POS=(17,45),LTH=7,ATTR=(PROT,NUM)
CMNAME   DFLD  POS=(17,53),LTH=25,ATTR=(PROT,NUM)
         DFLD  'Last Name:',POS=(18,5),LTH=10,ATTR=(PROT,NUM)
CLNAME   DFLD  POS=(18,16),LTH=25,ATTR=(PROT,NUM)
         DFLD  'Gov ID:',POS=(18,44),LTH=7,ATTR=(PROT,NUM)
CGOVID   DFLD  POS=(18,52),LTH=15,ATTR=(PROT,NUM)
         DFLD  'DOB:',POS=(19,5),LTH=4,ATTR=(PROT,NUM)
CDOB     DFLD  POS=(19,10),LTH=10,ATTR=(PROT,NUM)
         DFLD  'EIN:',POS=(19,23),LTH=4,ATTR=(PROT,NUM)
CEIN     DFLD  POS=(19,28),LTH=10,ATTR=(PROT,NUM)
         DFLD  'FICO:',POS=(19,41),LTH=5,ATTR=(PROT,NUM)
CFICO    DFLD  POS=(19,47),LTH=3,ATTR=(PROT,NUM)
         DFLD  'Address:',POS=(20,5),LTH=8,ATTR=(PROT,NUM)
CADDR1   DFLD  POS=(20,14),LTH=25,ATTR=(PROT,NUM)
CADDR2   DFLD  POS=(20,40),LTH=25,ATTR=(PROT,NUM)
         DFLD  'City:',POS=(21,5),LTH=5,ATTR=(PROT,NUM)
CCITY    DFLD  POS=(21,11),LTH=25,ATTR=(PROT,NUM)
         DFLD  'State:',POS=(21,39),LTH=6,ATTR=(PROT,NUM)
CSTATE   DFLD  POS=(21,46),LTH=2,ATTR=(PROT,NUM)
         DFLD  'Zip:',POS=(21,51),LTH=4,ATTR=(PROT,NUM)
CZIP     DFLD  POS=(21,56),LTH=10,ATTR=(PROT,NUM)
         DFLD  'Phone:',POS=(21,69),LTH=6,ATTR=(PROT,NUM)
CPHONE   DFLD  POS=(22,5),LTH=15,ATTR=(PROT,NUM)
ERRMSG   DFLD  POS=(23,1),LTH=78,ATTR=(PROT,MOD)
         DFLD  'ENTER=Continue  F3=Back  F5=Update',POS=(24,1), X
               LTH=34,ATTR=(PROT,NUM)
         FMTEND
***********************************************************************
*    MOD - Message Output Descriptor
***********************************************************************
CACTVWMO MSG   TYPE=OUTPUT,SOR=(COACTVW,IGNORE),NXT=CACTVWMI
         SEG
         MFLD  TRNNAME,LTH=4
         MFLD  TITLE01,LTH=40
         MFLD  CURDATE,LTH=8
         MFLD  PGMNAME,LTH=8
         MFLD  TITLE02,LTH=40
         MFLD  CURTIME,LTH=8
         MFLD  ACCTSID,LTH=11
         MFLD  ACSTTUS,LTH=1
         MFLD  ADTOPEN,LTH=10
         MFLD  AEXPDT,LTH=10
         MFLD  ACRDLIM,LTH=15
         MFLD  ACSHLIM,LTH=15
         MFLD  AREISDT,LTH=10
         MFLD  ACURBAL,LTH=15
         MFLD  ACRCYCR,LTH=15
         MFLD  ACRCYDB,LTH=15
         MFLD  CFNAME,LTH=25
         MFLD  CMNAME,LTH=25
         MFLD  CLNAME,LTH=25
         MFLD  CGOVID,LTH=15
         MFLD  CDOB,LTH=10
         MFLD  CEIN,LTH=10
         MFLD  CFICO,LTH=3
         MFLD  CADDR1,LTH=25
         MFLD  CADDR2,LTH=25
         MFLD  CCITY,LTH=25
         MFLD  CSTATE,LTH=2
         MFLD  CZIP,LTH=10
         MFLD  CPHONE,LTH=15
         MFLD  ERRMSG,LTH=78
         MSGEND
***********************************************************************
*    MID - Message Input Descriptor
***********************************************************************
CACTVWMI MSG   TYPE=INPUT,SOR=(COACTVW,IGNORE),NXT=CACTVWMO
         SEG
         MFLD  ACCTSID,LTH=11,FILL=NULL
         MSGEND
         END
