***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    MFS Source for COBIL00 - Bill Payment Screen
*    Converted from BMS: app/bms/COBIL00.bms
***********************************************************************
         PRINT NOGEN
COBIL00  FMT   DEV(TYPE=3270,FEAT=IGNORE,DSCA=X'00A0')
         DIV   TYPE=INOUT
         DPAGE FILL=PT,CURSOR=((6,21))
***********************************************************************
*    Header Fields
***********************************************************************
         DFLD  'Tran:',POS=(1,1),LTH=5,ATTR=(PROT,NUM)
TRNNAME  DFLD  POS=(1,7),LTH=4,ATTR=(PROT,NUM)
TITLE01  DFLD  POS=(1,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Date:',POS=(1,65),LTH=5,ATTR=(PROT,NUM)
CURDATE  DFLD  POS=(1,71),LTH=8,ATTR=(PROT,NUM)
         DFLD  'Prog:',POS=(2,1),LTH=5,ATTR=(PROT,NUM)
PGMNAME  DFLD  POS=(2,7),LTH=8,ATTR=(PROT,NUM)
TITLE02  DFLD  POS=(2,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Time:',POS=(2,65),LTH=5,ATTR=(PROT,NUM)
CURTIME  DFLD  POS=(2,71),LTH=8,ATTR=(PROT,NUM)
***********************************************************************
*    Bill Payment Body
***********************************************************************
         DFLD  'Bill Payment',POS=(4,35),LTH=12,ATTR=(PROT,HI)
         DFLD  'Enter Acct ID:',POS=(6,6),LTH=14,ATTR=(PROT,NUM)
ACTIDIN  DFLD  POS=(6,21),LTH=11,ATTR=(MOD,NUM)
         DFLD  '----------------------------------------------', X
               POS=(8,6),LTH=70,ATTR=(PROT,NUM)
         DFLD  'Your current balance is: ',POS=(11,6),LTH=25, X
               ATTR=(PROT,NUM)
CURBAL   DFLD  POS=(11,32),LTH=14,ATTR=(PROT,NUM)
         DFLD  'Do you want to pay your balance now. Please confirm: ', X
               POS=(15,6),LTH=53,ATTR=(PROT,NUM)
CONFIRM  DFLD  POS=(15,60),LTH=1,ATTR=(MOD,NUM)
         DFLD  '(Y/N)',POS=(15,63),LTH=5,ATTR=(PROT,NUM)
ERRMSG   DFLD  POS=(23,1),LTH=78,ATTR=(PROT,MOD)
         DFLD  'ENTER=Continue  F3=Back  F4=Clear',POS=(24,1), X
               LTH=33,ATTR=(PROT,NUM)
         FMTEND
***********************************************************************
*    MOD - Message Output Descriptor
***********************************************************************
CBIL00MO MSG   TYPE=OUTPUT,SOR=(COBIL00,IGNORE),NXT=CBIL00MI
         SEG
         MFLD  TRNNAME,LTH=4
         MFLD  TITLE01,LTH=40
         MFLD  CURDATE,LTH=8
         MFLD  PGMNAME,LTH=8
         MFLD  TITLE02,LTH=40
         MFLD  CURTIME,LTH=8
         MFLD  ACTIDIN,LTH=11
         MFLD  CURBAL,LTH=14
         MFLD  CONFIRM,LTH=1
         MFLD  ERRMSG,LTH=78
         MSGEND
***********************************************************************
*    MID - Message Input Descriptor
***********************************************************************
CBIL00MI MSG   TYPE=INPUT,SOR=(COBIL00,IGNORE),NXT=CBIL00MO
         SEG
         MFLD  ACTIDIN,LTH=11,FILL=NULL
         MFLD  CONFIRM,LTH=1,FILL=NULL
         MSGEND
         END
