***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    MFS Source for COMEN01 - Main Menu Screen
*    Converted from BMS: app/bms/COMEN01.bms
***********************************************************************
         PRINT NOGEN
COMEN01  FMT   DEV(TYPE=3270,FEAT=IGNORE,DSCA=X'00A0')
         DIV   TYPE=INOUT
         DPAGE FILL=PT,CURSOR=((20,41))
***********************************************************************
*    Header Fields
***********************************************************************
         DFLD  'Tran:',POS=(1,1),LTH=5,ATTR=(PROT,NUM)
TRNNAME  DFLD  POS=(1,7),LTH=4,ATTR=(PROT,NUM)
TITLE01  DFLD  POS=(1,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Date:',POS=(1,65),LTH=5,ATTR=(PROT,NUM)
CURDATE  DFLD  POS=(1,71),LTH=8,ATTR=(PROT,NUM)
         DFLD  'Prog:',POS=(2,1),LTH=5,ATTR=(PROT,NUM)
PGMNAME  DFLD  POS=(2,7),LTH=8,ATTR=(PROT,NUM)
TITLE02  DFLD  POS=(2,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Time:',POS=(2,65),LTH=5,ATTR=(PROT,NUM)
CURTIME  DFLD  POS=(2,71),LTH=8,ATTR=(PROT,NUM)
***********************************************************************
*    Menu Body
***********************************************************************
         DFLD  'Main Menu',POS=(4,35),LTH=9,ATTR=(PROT,HI)
OPTN001  DFLD  POS=(6,20),LTH=40,ATTR=(PROT,NUM)
OPTN002  DFLD  POS=(7,20),LTH=40,ATTR=(PROT,NUM)
OPTN003  DFLD  POS=(8,20),LTH=40,ATTR=(PROT,NUM)
OPTN004  DFLD  POS=(9,20),LTH=40,ATTR=(PROT,NUM)
OPTN005  DFLD  POS=(10,20),LTH=40,ATTR=(PROT,NUM)
OPTN006  DFLD  POS=(11,20),LTH=40,ATTR=(PROT,NUM)
OPTN007  DFLD  POS=(12,20),LTH=40,ATTR=(PROT,NUM)
OPTN008  DFLD  POS=(13,20),LTH=40,ATTR=(PROT,NUM)
OPTN009  DFLD  POS=(14,20),LTH=40,ATTR=(PROT,NUM)
OPTN010  DFLD  POS=(15,20),LTH=40,ATTR=(PROT,NUM)
OPTN011  DFLD  POS=(16,20),LTH=40,ATTR=(PROT,NUM)
OPTN012  DFLD  POS=(17,20),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Please select an option :',POS=(20,15),LTH=25, X
               ATTR=(PROT,HI)
OPTION   DFLD  POS=(20,41),LTH=2,ATTR=(MOD,NUM)
ERRMSG   DFLD  POS=(23,1),LTH=78,ATTR=(PROT,MOD)
         DFLD  'ENTER=Continue  F3=Exit',POS=(24,1),LTH=23, X
               ATTR=(PROT,NUM)
         FMTEND
***********************************************************************
*    MOD - Message Output Descriptor
***********************************************************************
COMN01MO MSG   TYPE=OUTPUT,SOR=(COMEN01,IGNORE),NXT=COMN01MI
         SEG
         MFLD  TRNNAME,LTH=4
         MFLD  TITLE01,LTH=40
         MFLD  CURDATE,LTH=8
         MFLD  PGMNAME,LTH=8
         MFLD  TITLE02,LTH=40
         MFLD  CURTIME,LTH=8
         MFLD  OPTN001,LTH=40
         MFLD  OPTN002,LTH=40
         MFLD  OPTN003,LTH=40
         MFLD  OPTN004,LTH=40
         MFLD  OPTN005,LTH=40
         MFLD  OPTN006,LTH=40
         MFLD  OPTN007,LTH=40
         MFLD  OPTN008,LTH=40
         MFLD  OPTN009,LTH=40
         MFLD  OPTN010,LTH=40
         MFLD  OPTN011,LTH=40
         MFLD  OPTN012,LTH=40
         MFLD  OPTION,LTH=2
         MFLD  ERRMSG,LTH=78
         MSGEND
***********************************************************************
*    MID - Message Input Descriptor
***********************************************************************
COMN01MI MSG   TYPE=INPUT,SOR=(COMEN01,IGNORE),NXT=COMN01MO
         SEG
         MFLD  OPTION,LTH=2,FILL=NULL
         MSGEND
         END
