***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    MFS Source for COSGN00 - Login Screen
*    Converted from BMS: app/bms/COSGN00.bms
***********************************************************************
         PRINT NOGEN
COSGN00  FMT   DEV(TYPE=3270,FEAT=IGNORE,DSCA=X'00A0')
         DIV   TYPE=INOUT
         DPAGE FILL=PT,CURSOR=((19,43))
***********************************************************************
*    Header Fields
***********************************************************************
         DFLD  'Tran :',POS=(1,1),LTH=6,ATTR=(PROT,NUM)
TRNNAME  DFLD  POS=(1,8),LTH=4,ATTR=(PROT,NUM)
TITLE01  DFLD  POS=(1,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Date :',POS=(1,64),LTH=6,ATTR=(PROT,NUM)
CURDATE  DFLD  POS=(1,71),LTH=8,ATTR=(PROT,NUM)
         DFLD  'Prog :',POS=(2,1),LTH=6,ATTR=(PROT,NUM)
PGMNAME  DFLD  POS=(2,8),LTH=8,ATTR=(PROT,NUM)
TITLE02  DFLD  POS=(2,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Time :',POS=(2,64),LTH=6,ATTR=(PROT,NUM)
CURTIME  DFLD  POS=(2,71),LTH=9,ATTR=(PROT,NUM)
         DFLD  'AppID:',POS=(3,1),LTH=6,ATTR=(PROT,NUM)
APPLID   DFLD  POS=(3,8),LTH=8,ATTR=(PROT,NUM)
         DFLD  'SysID:',POS=(3,64),LTH=6,ATTR=(PROT,NUM)
SYSID    DFLD  POS=(3,71),LTH=8,ATTR=(PROT,NUM)
***********************************************************************
*    Screen Body - Dollar Bill Art and Login Fields
***********************************************************************
         DFLD  'This is a Credit Card Demo Application', X
               POS=(5,6),LTH=38,ATTR=(PROT,NUM)
         DFLD  'for Mainframe Modernization',            X
               POS=(5,45),LTH=27,ATTR=(PROT,NUM)
         DFLD  '+========================================+', X
               POS=(7,21),LTH=42,ATTR=(PROT,NUM)
         DFLD  '|   NATIONAL RESERVE NOTE               |', X
               POS=(8,21),LTH=42,ATTR=(PROT,NUM)
         DFLD  '|(1) THE UNITED STATES OF KICSLAND   (1)|', X
               POS=(9,21),LTH=42,ATTR=(PROT,NUM)
         DFLD  '|$$             ___      ********    $$  |', X
               POS=(10,21),LTH=42,ATTR=(PROT,NUM)
         DFLD  '|$   {x}      (o o)                  $  |', X
               POS=(11,21),LTH=42,ATTR=(PROT,NUM)
         DFLD  '|$    ******  ( V  )     O N E       $  |', X
               POS=(12,21),LTH=42,ATTR=(PROT,NUM)
         DFLD  '|(1)         ---m-m---            (1)|', X
               POS=(13,21),LTH=42,ATTR=(PROT,NUM)
         DFLD  '|  ~~~~~~~~~~~ ONE DOLLAR ~~~~~~~~~~~~~ |', X
               POS=(14,21),LTH=42,ATTR=(PROT,NUM)
         DFLD  '+========================================+', X
               POS=(15,21),LTH=42,ATTR=(PROT,NUM)
         DFLD  'Type your User ID and Password, then press ENTER:', X
               POS=(17,16),LTH=49,ATTR=(PROT,NUM)
         DFLD  'User ID     :',POS=(19,29),LTH=13,ATTR=(PROT,NUM)
USERID   DFLD  POS=(19,43),LTH=8,ATTR=(MOD,NUM)
         DFLD  '(8 Char)',POS=(19,52),LTH=8,ATTR=(PROT,NUM)
         DFLD  'Password    :',POS=(20,29),LTH=13,ATTR=(PROT,NUM)
PASSWD   DFLD  POS=(20,43),LTH=8,ATTR=(MOD,NODISP)
         DFLD  '(8 Char)',POS=(20,52),LTH=8,ATTR=(PROT,NUM)
ERRMSG   DFLD  POS=(23,1),LTH=78,ATTR=(PROT,MOD)
         DFLD  'ENTER=Sign-on  F3=Exit',POS=(24,1),LTH=22, X
               ATTR=(PROT,NUM)
         FMTEND
***********************************************************************
*    MOD - Message Output Descriptor
***********************************************************************
COSGN0MO MSG   TYPE=OUTPUT,SOR=(COSGN00,IGNORE),NXT=COSGN0MI
         SEG
         MFLD  TRNNAME,LTH=4
         MFLD  TITLE01,LTH=40
         MFLD  CURDATE,LTH=8
         MFLD  PGMNAME,LTH=8
         MFLD  TITLE02,LTH=40
         MFLD  CURTIME,LTH=9
         MFLD  APPLID,LTH=8
         MFLD  SYSID,LTH=8
         MFLD  USERID,LTH=8
         MFLD  PASSWD,LTH=8
         MFLD  ERRMSG,LTH=78
         MSGEND
***********************************************************************
*    MID - Message Input Descriptor
***********************************************************************
COSGN0MI MSG   TYPE=INPUT,SOR=(COSGN00,IGNORE),NXT=COSGN0MO
         SEG
         MFLD  USERID,LTH=8,FILL=NULL
         MFLD  PASSWD,LTH=8,FILL=NULL
         MSGEND
         END
