***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    MFS Source for COTRN01 - Transaction View Screen
*    Converted from BMS: app/bms/COTRN01.bms
***********************************************************************
         PRINT NOGEN
COTRN01  FMT   DEV(TYPE=3270,FEAT=IGNORE,DSCA=X'00A0')
         DIV   TYPE=INOUT
         DPAGE FILL=PT,CURSOR=((6,21))
***********************************************************************
*    Header Fields
***********************************************************************
         DFLD  'Tran:',POS=(1,1),LTH=5,ATTR=(PROT,NUM)
TRNNAME  DFLD  POS=(1,7),LTH=4,ATTR=(PROT,NUM)
TITLE01  DFLD  POS=(1,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Date:',POS=(1,65),LTH=5,ATTR=(PROT,NUM)
CURDATE  DFLD  POS=(1,71),LTH=8,ATTR=(PROT,NUM)
         DFLD  'Prog:',POS=(2,1),LTH=5,ATTR=(PROT,NUM)
PGMNAME  DFLD  POS=(2,7),LTH=8,ATTR=(PROT,NUM)
TITLE02  DFLD  POS=(2,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Time:',POS=(2,65),LTH=5,ATTR=(PROT,NUM)
CURTIME  DFLD  POS=(2,71),LTH=8,ATTR=(PROT,NUM)
***********************************************************************
*    Transaction View Body
***********************************************************************
         DFLD  'View Transaction',POS=(4,32),LTH=16,ATTR=(PROT,HI)
         DFLD  'Transaction ID:',POS=(6,6),LTH=15,ATTR=(PROT,NUM)
TRNID    DFLD  POS=(6,22),LTH=16,ATTR=(PROT,NUM)
         DFLD  'Card Number:',POS=(8,6),LTH=12,ATTR=(PROT,NUM)
CARDNO   DFLD  POS=(8,19),LTH=16,ATTR=(PROT,NUM)
         DFLD  'Type Code:',POS=(10,6),LTH=10,ATTR=(PROT,NUM)
TTYPCD   DFLD  POS=(10,17),LTH=2,ATTR=(PROT,NUM)
TTYDSC   DFLD  POS=(10,21),LTH=30,ATTR=(PROT,NUM)
         DFLD  'Category:',POS=(10,55),LTH=9,ATTR=(PROT,NUM)
TCATCD   DFLD  POS=(10,65),LTH=4,ATTR=(PROT,NUM)
         DFLD  'Source:',POS=(12,6),LTH=7,ATTR=(PROT,NUM)
TRNSRC   DFLD  POS=(12,14),LTH=10,ATTR=(PROT,NUM)
         DFLD  'Description:',POS=(14,6),LTH=12,ATTR=(PROT,NUM)
TDESC    DFLD  POS=(14,19),LTH=60,ATTR=(PROT,NUM)
         DFLD  'Amount:',POS=(16,6),LTH=7,ATTR=(PROT,NUM)
TRNAMT   DFLD  POS=(16,14),LTH=12,ATTR=(PROT,NUM)
         DFLD  'Orig Date:',POS=(16,30),LTH=10,ATTR=(PROT,NUM)
TORIGDT  DFLD  POS=(16,41),LTH=10,ATTR=(PROT,NUM)
         DFLD  'Proc Date:',POS=(16,55),LTH=10,ATTR=(PROT,NUM)
TPROCDT  DFLD  POS=(16,66),LTH=10,ATTR=(PROT,NUM)
         DFLD  'Merchant ID:',POS=(18,6),LTH=12,ATTR=(PROT,NUM)
TMID     DFLD  POS=(18,19),LTH=9,ATTR=(PROT,NUM)
         DFLD  'Merchant Name:',POS=(18,32),LTH=14,ATTR=(PROT,NUM)
MNAME    DFLD  POS=(18,47),LTH=30,ATTR=(PROT,NUM)
         DFLD  'Merchant City:',POS=(20,6),LTH=14,ATTR=(PROT,NUM)
MCITY    DFLD  POS=(20,21),LTH=25,ATTR=(PROT,NUM)
         DFLD  'Merchant Zip:',POS=(20,50),LTH=13,ATTR=(PROT,NUM)
MZIP     DFLD  POS=(20,64),LTH=10,ATTR=(PROT,NUM)
ERRMSG   DFLD  POS=(23,1),LTH=78,ATTR=(PROT,MOD)
         DFLD  'ENTER=Continue  F3=Back',POS=(24,1),LTH=23, X
               ATTR=(PROT,NUM)
         FMTEND
***********************************************************************
*    MOD - Message Output Descriptor
***********************************************************************
CTRN01MO MSG   TYPE=OUTPUT,SOR=(COTRN01,IGNORE),NXT=CTRN01MI
         SEG
         MFLD  TRNNAME,LTH=4
         MFLD  TITLE01,LTH=40
         MFLD  CURDATE,LTH=8
         MFLD  PGMNAME,LTH=8
         MFLD  TITLE02,LTH=40
         MFLD  CURTIME,LTH=8
         MFLD  TRNID,LTH=16
         MFLD  CARDNO,LTH=16
         MFLD  TTYPCD,LTH=2
         MFLD  TTYDSC,LTH=30
         MFLD  TCATCD,LTH=4
         MFLD  TRNSRC,LTH=10
         MFLD  TDESC,LTH=60
         MFLD  TRNAMT,LTH=12
         MFLD  TORIGDT,LTH=10
         MFLD  TPROCDT,LTH=10
         MFLD  TMID,LTH=9
         MFLD  MNAME,LTH=30
         MFLD  MCITY,LTH=25
         MFLD  MZIP,LTH=10
         MFLD  ERRMSG,LTH=78
         MSGEND
***********************************************************************
*    MID - Message Input Descriptor
***********************************************************************
CTRN01MI MSG   TYPE=INPUT,SOR=(COTRN01,IGNORE),NXT=CTRN01MO
         SEG
         MFLD  TRNID,LTH=16,FILL=NULL
         MSGEND
         END
