***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    MFS Source for COUSR03 - Delete User Screen
*    Converted from BMS: app/bms/COUSR03.bms
***********************************************************************
         PRINT NOGEN
COUSR03  FMT   DEV(TYPE=3270,FEAT=IGNORE,DSCA=X'00A0')
         DIV   TYPE=INOUT
         DPAGE FILL=PT,CURSOR=((6,21))
***********************************************************************
*    Header Fields
***********************************************************************
         DFLD  'Tran:',POS=(1,1),LTH=5,ATTR=(PROT,NUM)
TRNNAME  DFLD  POS=(1,7),LTH=4,ATTR=(PROT,NUM)
TITLE01  DFLD  POS=(1,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Date:',POS=(1,65),LTH=5,ATTR=(PROT,NUM)
CURDATE  DFLD  POS=(1,71),LTH=8,ATTR=(PROT,NUM)
         DFLD  'Prog:',POS=(2,1),LTH=5,ATTR=(PROT,NUM)
PGMNAME  DFLD  POS=(2,7),LTH=8,ATTR=(PROT,NUM)
TITLE02  DFLD  POS=(2,21),LTH=40,ATTR=(PROT,NUM)
         DFLD  'Time:',POS=(2,65),LTH=5,ATTR=(PROT,NUM)
CURTIME  DFLD  POS=(2,71),LTH=8,ATTR=(PROT,NUM)
***********************************************************************
*    Delete User Body
***********************************************************************
         DFLD  'Delete User',POS=(4,35),LTH=11,ATTR=(PROT,HI)
         DFLD  'Enter User ID:',POS=(6,6),LTH=14,ATTR=(PROT,NUM)
USRIDIN  DFLD  POS=(6,21),LTH=8,ATTR=(MOD,NUM)
         DFLD  '**********************************************', X
               POS=(8,6),LTH=70,ATTR=(PROT,NUM)
         DFLD  'First Name:',POS=(11,6),LTH=11,ATTR=(PROT,NUM)
FNAME    DFLD  POS=(11,18),LTH=20,ATTR=(PROT,NUM)
         DFLD  'Last Name:',POS=(13,6),LTH=10,ATTR=(PROT,NUM)
LNAME    DFLD  POS=(13,18),LTH=20,ATTR=(PROT,NUM)
         DFLD  'User Type: ',POS=(15,6),LTH=11,ATTR=(PROT,NUM)
USRTYPE  DFLD  POS=(15,17),LTH=1,ATTR=(PROT,NUM)
         DFLD  '(A=Admin, U=User)',POS=(15,19),LTH=17, X
               ATTR=(PROT,NUM)
ERRMSG   DFLD  POS=(23,1),LTH=78,ATTR=(PROT,MOD)
         DFLD  'ENTER=Fetch  F3=Back  F4=Clear  F5=Delete', X
               POS=(24,1),LTH=41,ATTR=(PROT,NUM)
         FMTEND
***********************************************************************
*    MOD - Message Output Descriptor
***********************************************************************
CUSR03MO MSG   TYPE=OUTPUT,SOR=(COUSR03,IGNORE),NXT=CUSR03MI
         SEG
         MFLD  TRNNAME,LTH=4
         MFLD  TITLE01,LTH=40
         MFLD  CURDATE,LTH=8
         MFLD  PGMNAME,LTH=8
         MFLD  TITLE02,LTH=40
         MFLD  CURTIME,LTH=8
         MFLD  USRIDIN,LTH=8
         MFLD  FNAME,LTH=20
         MFLD  LNAME,LTH=20
         MFLD  USRTYPE,LTH=1
         MFLD  ERRMSG,LTH=78
         MSGEND
***********************************************************************
*    MID - Message Input Descriptor
***********************************************************************
CUSR03MI MSG   TYPE=INPUT,SOR=(COUSR03,IGNORE),NXT=CUSR03MO
         SEG
         MFLD  USRIDIN,LTH=8,FILL=NULL
         MSGEND
         END
