 /*********************************************************************/
 /* Program     : CBACT02C.PLI                                        */
 /* Application : CardDemo                                            */
 /* Type        : IMS Batch PL/I Program (BMP)                        */
 /* Function    : Card Data Refresh - Load card master                */
 /* Converted from COBOL batch: app/cbl/CBACT02C.cbl                 */
 /*********************************************************************/
 /* Copyright Amazon.com, Inc. or its affiliates.                     */
 /* All Rights Reserved.                                              */
 /* Licensed under the Apache License, Version 2.0                    */
 /*********************************************************************/

 CBACT02C: PROC(IO_PCB_PTR, DB_CARD_PTR) OPTIONS(MAIN);

   DCL IO_PCB_PTR     POINTER;
   DCL DB_CARD_PTR    POINTER;

   DCL 1 IO_PCB BASED(IO_PCB_PTR),
         2 IO_LTERM    CHAR(8),  2 IO_RESV  CHAR(2),
         2 IO_STATUS   CHAR(2);

   DCL 1 DB_CARD BASED(DB_CARD_PTR),
         2 CARD_DBNAME  CHAR(8),  2 CARD_LEVEL  CHAR(2),
         2 CARD_STATUS  CHAR(2),  2 CARD_PROC   CHAR(4),
         2 CARD_RESV    FIXED BIN(31),
         2 CARD_SEGNAME CHAR(8),  2 CARD_KEYLEN FIXED BIN(31),
         2 CARD_SENSEG  FIXED BIN(31),
         2 CARD_KEYVAL  CHAR(256);

   DCL CARDDATA_FILE FILE RECORD INPUT ENV(FB RECSIZE(150));

   %INCLUDE CVACT02Y;

   DCL WS_RECORD_COUNT  FIXED BIN(31) INIT(0);
   DCL WS_LOADED_COUNT  FIXED BIN(31) INIT(0);
   DCL WS_EOF           CHAR(1) INIT('N');

   DCL CARD_SSA CHAR(40);

   DCL ISRT CHAR(4) INIT('ISRT');
   DCL PLITDLI EXTERNAL ENTRY OPTIONS(ASM INTER);

   /******************************************************************/
   /* MAIN PROCESSING                                                */
   /******************************************************************/
   PUT SKIP LIST('START OF EXECUTION OF PROGRAM CBACT02C');

   ON ENDFILE(CARDDATA_FILE) WS_EOF = 'Y';

   OPEN FILE(CARDDATA_FILE);

   READ FILE(CARDDATA_FILE) INTO(CARD_RECORD);

   DO WHILE(WS_EOF = 'N');
     WS_RECORD_COUNT = WS_RECORD_COUNT + 1;

     CARD_SSA = 'CARDSEG ';
     CALL PLITDLI(ISRT, DB_CARD_PTR, CARD_RECORD, CARD_SSA);

     IF CARD_STATUS = '  ' THEN
       WS_LOADED_COUNT = WS_LOADED_COUNT + 1;
     ELSE
       PUT SKIP LIST('ERROR LOADING CARD: ' || CARD_NUM ||
                     ' STATUS: ' || CARD_STATUS);

     READ FILE(CARDDATA_FILE) INTO(CARD_RECORD);
   END;

   CLOSE FILE(CARDDATA_FILE);

   PUT SKIP LIST('RECORDS READ:   ' || WS_RECORD_COUNT);
   PUT SKIP LIST('RECORDS LOADED: ' || WS_LOADED_COUNT);
   PUT SKIP LIST('END OF EXECUTION OF PROGRAM CBACT02C');

   RETURN;

 END CBACT02C;
