 /*********************************************************************/
 /* Program     : CBACT04C.PLI                                        */
 /* Application : CardDemo                                            */
 /* Type        : IMS Batch PL/I Program (BMP)                        */
 /* Function    : Interest Calculator                                 */
 /* Converted from COBOL batch: app/cbl/CBACT04C.cbl                 */
 /*********************************************************************/
 /* Copyright Amazon.com, Inc. or its affiliates.                     */
 /* All Rights Reserved.                                              */
 /* Licensed under the Apache License, Version 2.0                    */
 /*********************************************************************/

 CBACT04C: PROC(IO_PCB_PTR, DB_TCATBAL_PTR, DB_XREF_PTR,
                 DB_ACCT_PTR, DB_DISCGRP_PTR, DB_TRAN_PTR)
                 OPTIONS(MAIN);

   DCL IO_PCB_PTR     POINTER;
   DCL DB_TCATBAL_PTR POINTER;
   DCL DB_XREF_PTR    POINTER;
   DCL DB_ACCT_PTR    POINTER;
   DCL DB_DISCGRP_PTR POINTER;
   DCL DB_TRAN_PTR    POINTER;

   DCL 1 IO_PCB BASED(IO_PCB_PTR),
         2 IO_LTERM    CHAR(8),  2 IO_RESV  CHAR(2),
         2 IO_STATUS   CHAR(2);

   DCL 1 DB_TCATBAL BASED(DB_TCATBAL_PTR),
         2 TCATBAL_DBNAME CHAR(8),  2 TCATBAL_LEVEL  CHAR(2),
         2 TCATBAL_STATUS CHAR(2),  2 TCATBAL_PROC   CHAR(4),
         2 TCATBAL_RESV   FIXED BIN(31),
         2 TCATBAL_SEGNAME CHAR(8), 2 TCATBAL_KEYLEN FIXED BIN(31),
         2 TCATBAL_SENSEG  FIXED BIN(31),
         2 TCATBAL_KEYVAL  CHAR(256);

   DCL 1 DB_XREF BASED(DB_XREF_PTR),
         2 XREF_DBNAME  CHAR(8),  2 XREF_LEVEL  CHAR(2),
         2 XREF_STATUS  CHAR(2),  2 XREF_PROC   CHAR(4),
         2 XREF_RESV    FIXED BIN(31),
         2 XREF_SEGNAME CHAR(8),  2 XREF_KEYLEN FIXED BIN(31),
         2 XREF_SENSEG  FIXED BIN(31),
         2 XREF_KEYVAL  CHAR(256);

   DCL 1 DB_ACCT BASED(DB_ACCT_PTR),
         2 ACCT_DBNAME  CHAR(8),  2 ACCT_LEVEL  CHAR(2),
         2 ACCT_STATUS  CHAR(2),  2 ACCT_PROC   CHAR(4),
         2 ACCT_RESV    FIXED BIN(31),
         2 ACCT_SEGNAME CHAR(8),  2 ACCT_KEYLEN FIXED BIN(31),
         2 ACCT_SENSEG  FIXED BIN(31),
         2 ACCT_KEYVAL  CHAR(256);

   DCL 1 DB_DISCGRP BASED(DB_DISCGRP_PTR),
         2 DISCGRP_DBNAME  CHAR(8),  2 DISCGRP_LEVEL  CHAR(2),
         2 DISCGRP_STATUS  CHAR(2),  2 DISCGRP_PROC   CHAR(4),
         2 DISCGRP_RESV    FIXED BIN(31),
         2 DISCGRP_SEGNAME CHAR(8),  2 DISCGRP_KEYLEN FIXED BIN(31),
         2 DISCGRP_SENSEG  FIXED BIN(31),
         2 DISCGRP_KEYVAL  CHAR(256);

   %INCLUDE CVTRA01Y;
   %INCLUDE CVACT03Y;
   %INCLUDE CVTRA02Y;
   %INCLUDE CVACT01Y;
   %INCLUDE CVTRA05Y;

   DCL WS_EOF            CHAR(1) INIT('N');
   DCL WS_FIRST_TIME     CHAR(1) INIT('Y');
   DCL WS_LAST_ACCT_NUM  CHAR(11) INIT(' ');
   DCL WS_MONTHLY_INT    FIXED DEC(11,2) INIT(0);
   DCL WS_TOTAL_INT      FIXED DEC(11,2) INIT(0);
   DCL WS_RECORD_COUNT   FIXED BIN(31) INIT(0);
   DCL WS_TRANID_SUFFIX  FIXED BIN(31) INIT(0);

   DCL TCATBAL_SSA CHAR(60);
   DCL ACCT_SSA    CHAR(40);
   DCL XREF_SSA    CHAR(50);
   DCL DISCGRP_SSA CHAR(60);
   DCL TRAN_SSA    CHAR(50);

   DCL GU   CHAR(4) INIT('GU  ');
   DCL GHU  CHAR(4) INIT('GHU ');
   DCL GN   CHAR(4) INIT('GN  ');
   DCL ISRT CHAR(4) INIT('ISRT');
   DCL REPL CHAR(4) INIT('REPL');
   DCL PLITDLI EXTERNAL ENTRY OPTIONS(ASM INTER);

   /******************************************************************/
   /* MAIN PROCESSING                                                */
   /******************************************************************/
   PUT SKIP LIST('START OF EXECUTION OF PROGRAM CBACT04C');

   /* Read first TCATBAL record */
   TCATBAL_SSA = 'TCATSEG ';
   CALL PLITDLI(GU, DB_TCATBAL_PTR,
                TRAN_CAT_BAL_RECORD, TCATBAL_SSA);

   DO WHILE(TCATBAL_STATUS = '  ');
     WS_RECORD_COUNT = WS_RECORD_COUNT + 1;

     /* Check if account changed */
     IF TRANCAT_ACCT_ID ^= WS_LAST_ACCT_NUM THEN DO;
       IF WS_FIRST_TIME ^= 'Y' THEN
         CALL UPDATE_ACCOUNT;
       ELSE
         WS_FIRST_TIME = 'N';

       WS_TOTAL_INT = 0;
       WS_LAST_ACCT_NUM = TRANCAT_ACCT_ID;

       /* Read account data */
       ACCT_SSA = 'ACCTSEG (ACCTID  =' || TRANCAT_ACCT_ID || ')';
       CALL PLITDLI(GU, DB_ACCT_PTR, ACCOUNT_RECORD, ACCT_SSA);

       /* Read xref for card number */
       XREF_SSA = 'CXREFSEG(ACCTID  =' || TRANCAT_ACCT_ID || ')';
       CALL PLITDLI(GU, DB_XREF_PTR, CARD_XREF_RECORD, XREF_SSA);
     END;

     /* Get interest rate for this category */
     CALL GET_INTEREST_RATE;

     IF DIS_INT_RATE ^= 0 THEN DO;
       CALL COMPUTE_INTEREST;
     END;

     /* Read next TCATBAL record */
     CALL PLITDLI(GN, DB_TCATBAL_PTR,
                  TRAN_CAT_BAL_RECORD);
   END;

   /* Update last account */
   IF WS_FIRST_TIME ^= 'Y' THEN
     CALL UPDATE_ACCOUNT;

   PUT SKIP LIST('RECORDS PROCESSED: ' || WS_RECORD_COUNT);
   PUT SKIP LIST('END OF EXECUTION OF PROGRAM CBACT04C');

   RETURN;

   /******************************************************************/
   /* GET_INTEREST_RATE                                              */
   /******************************************************************/
   GET_INTEREST_RATE: PROC;
     DISCGRP_SSA = 'DISCSEG (GRPID   =' || ACCT_GROUP_ID ||
                             'TTYPCD  =' || TRANCAT_TYPE_CD ||
                             'TCATCD  =' || TRANCAT_CD || ')';

     CALL PLITDLI(GU, DB_DISCGRP_PTR,
                  DIS_GROUP_RECORD, DISCGRP_SSA);

     IF DISCGRP_STATUS ^= '  ' THEN
       DIS_INT_RATE = 0;
   END GET_INTEREST_RATE;

   /******************************************************************/
   /* COMPUTE_INTEREST                                               */
   /******************************************************************/
   COMPUTE_INTEREST: PROC;
     WS_MONTHLY_INT = (TRAN_CAT_BAL * DIS_INT_RATE) / 1200;
     WS_TOTAL_INT = WS_TOTAL_INT + WS_MONTHLY_INT;
   END COMPUTE_INTEREST;

   /******************************************************************/
   /* UPDATE_ACCOUNT                                                 */
   /******************************************************************/
   UPDATE_ACCOUNT: PROC;
     /* Re-read account with hold for update */
     ACCT_SSA = 'ACCTSEG (ACCTID  =' || WS_LAST_ACCT_NUM || ')';
     CALL PLITDLI(GHU, DB_ACCT_PTR, ACCOUNT_RECORD, ACCT_SSA);

     IF ACCT_STATUS = '  ' THEN DO;
       ACCT_CURR_BAL = ACCT_CURR_BAL + WS_TOTAL_INT;
       ACCT_CURR_CYC_CREDIT = 0;
       ACCT_CURR_CYC_DEBIT = 0;
       CALL PLITDLI(REPL, DB_ACCT_PTR, ACCOUNT_RECORD);
     END;
   END UPDATE_ACCOUNT;

 END CBACT04C;
