 /*********************************************************************/
 /* Program     : COACTUPC.PLI                                        */
 /* Application : CardDemo                                            */
 /* Type        : IMS PL/I Program                                    */
 /* Function    : Accept and process Account Update                   */
 /* Converted from COBOL/CICS: app/cbl/COACTUPC.cbl                  */
 /*********************************************************************/
 /* Copyright Amazon.com, Inc. or its affiliates.                     */
 /* All Rights Reserved.                                              */
 /* Licensed under the Apache License, Version 2.0                    */
 /*********************************************************************/

 COACTUPC: PROC(IO_PCB_PTR, ALT_PCB_PTR,
                 DB_ACCT_PTR, DB_CARD_PTR,
                 DB_CUST_PTR, DB_CXREF_PTR) OPTIONS(MAIN);

   DCL IO_PCB_PTR    POINTER;
   DCL ALT_PCB_PTR   POINTER;
   DCL DB_ACCT_PTR   POINTER;
   DCL DB_CARD_PTR   POINTER;
   DCL DB_CUST_PTR   POINTER;
   DCL DB_CXREF_PTR  POINTER;

   DCL 1 IO_PCB BASED(IO_PCB_PTR),
         2 IO_LTERM    CHAR(8),
         2 IO_RESV     CHAR(2),
         2 IO_STATUS   CHAR(2),
         2 IO_DATE     FIXED BIN(31),
         2 IO_TIME     FIXED BIN(31),
         2 IO_SEQ      FIXED BIN(31),
         2 IO_MOD      CHAR(8);

   DCL 1 ALT_PCB BASED(ALT_PCB_PTR),
         2 ALT_DEST    CHAR(8),
         2 ALT_RESV    CHAR(2),
         2 ALT_STATUS  CHAR(2);

   DCL 1 DB_ACCT BASED(DB_ACCT_PTR),
         2 ACCT_DBNAME  CHAR(8),  2 ACCT_LEVEL  CHAR(2),
         2 ACCT_STATUS  CHAR(2),  2 ACCT_PROC   CHAR(4),
         2 ACCT_RESV    FIXED BIN(31),
         2 ACCT_SEGNAME CHAR(8),  2 ACCT_KEYLEN FIXED BIN(31),
         2 ACCT_SENSEG  FIXED BIN(31),
         2 ACCT_KEYVAL  CHAR(256);

   DCL 1 DB_CUST BASED(DB_CUST_PTR),
         2 CUST_DBNAME  CHAR(8),  2 CUST_LEVEL  CHAR(2),
         2 CUST_STATUS  CHAR(2),  2 CUST_PROC   CHAR(4),
         2 CUST_RESV    FIXED BIN(31),
         2 CUST_SEGNAME CHAR(8),  2 CUST_KEYLEN FIXED BIN(31),
         2 CUST_SENSEG  FIXED BIN(31),
         2 CUST_KEYVAL  CHAR(256);

   DCL 1 DB_CXREF BASED(DB_CXREF_PTR),
         2 CXREF_DBNAME  CHAR(8),  2 CXREF_LEVEL  CHAR(2),
         2 CXREF_STATUS  CHAR(2),  2 CXREF_PROC   CHAR(4),
         2 CXREF_RESV    FIXED BIN(31),
         2 CXREF_SEGNAME CHAR(8),  2 CXREF_KEYLEN FIXED BIN(31),
         2 CXREF_SENSEG  FIXED BIN(31),
         2 CXREF_KEYVAL  CHAR(256);

   DCL WS_PGMNAME     CHAR(8) INIT('COACTUPC');
   DCL WS_TRANID      CHAR(4) INIT('CAUP');
   DCL WS_MESSAGE      CHAR(80) INIT(' ');
   DCL WS_ERR_FLG      CHAR(1) INIT('N');
   DCL WS_RETURN_MSG   CHAR(75) INIT(' ');
   DCL WS_DATA_CHANGED CHAR(1) INIT('N');

   %INCLUDE COCOM01Y;
   %INCLUDE CVCRD01Y;
   %INCLUDE COTTL01Y;
   %INCLUDE CSDAT01Y;
   %INCLUDE CSMSG01Y;
   %INCLUDE CSMSG02Y;
   %INCLUDE CSUSR01Y;
   %INCLUDE CVACT01Y;
   %INCLUDE CVACT02Y;
   %INCLUDE CVACT03Y;
   %INCLUDE CVCUS01Y;
   %INCLUDE CSUTLDWY;
   %INCLUDE CSLKPCDY;

   DCL 1 INPUT_MSG,
         2 LL           FIXED BIN(15),
         2 ZZ           FIXED BIN(15),
         2 TRANCODE     CHAR(8),
         2 IN_ACCTID    CHAR(11),
         2 IN_ACTSTATUS CHAR(1),
         2 IN_CREDLIM   CHAR(14),
         2 IN_CASHLIM   CHAR(14),
         2 IN_CURBAL    CHAR(14),
         2 IN_OPENDT    CHAR(10),
         2 IN_EXPDT     CHAR(10),
         2 IN_REISSDT   CHAR(10),
         2 IN_CYCCRED   CHAR(14),
         2 IN_CYCDEB    CHAR(14),
         2 IN_CUSTID    CHAR(9),
         2 IN_FNAME     CHAR(25),
         2 IN_LNAME     CHAR(25),
         2 IN_ADDR1     CHAR(50),
         2 IN_ADDR2     CHAR(50),
         2 IN_STCD      CHAR(2),
         2 IN_ZIP       CHAR(10),
         2 IN_PHONE1    CHAR(15),
         2 IN_PHONE2    CHAR(15),
         2 IN_SSN       CHAR(9),
         2 IN_FICO      CHAR(3),
         2 IN_DOB       CHAR(10),
         2 IN_COMMAREA  CHAR(LENGTH(CARDDEMO_COMMAREA));

   DCL 1 OUTPUT_MSG,
         2 LL           FIXED BIN(15),
         2 ZZ           FIXED BIN(15),
         2 OUT_TRNNAME  CHAR(4),
         2 OUT_TITLE01  CHAR(40),
         2 OUT_CURDATE  CHAR(8),
         2 OUT_PGMNAME  CHAR(8),
         2 OUT_TITLE02  CHAR(40),
         2 OUT_CURTIME  CHAR(8),
         2 OUT_ACCTID   CHAR(11),
         2 OUT_ACTSTATUS CHAR(1),
         2 OUT_CREDLIM  CHAR(14),
         2 OUT_CASHLIM  CHAR(14),
         2 OUT_CURBAL   CHAR(14),
         2 OUT_OPENDT   CHAR(10),
         2 OUT_EXPDT    CHAR(10),
         2 OUT_REISSDT  CHAR(10),
         2 OUT_CYCCRED  CHAR(14),
         2 OUT_CYCDEB   CHAR(14),
         2 OUT_GRPID    CHAR(10),
         2 OUT_CUSTID   CHAR(9),
         2 OUT_FNAME    CHAR(25),
         2 OUT_MNAME    CHAR(25),
         2 OUT_LNAME    CHAR(25),
         2 OUT_ADDR1    CHAR(50),
         2 OUT_ADDR2    CHAR(50),
         2 OUT_STCD     CHAR(2),
         2 OUT_CNTRYCD  CHAR(3),
         2 OUT_ZIP      CHAR(10),
         2 OUT_PHONE1   CHAR(15),
         2 OUT_PHONE2   CHAR(15),
         2 OUT_SSN      CHAR(9),
         2 OUT_FICOSCORE CHAR(3),
         2 OUT_DOB      CHAR(10),
         2 OUT_INFOMSG  CHAR(40),
         2 OUT_ERRMSG   CHAR(78);

   DCL ACCT_SSA CHAR(40);
   DCL CXREF_SSA CHAR(50);
   DCL CUST_SSA CHAR(40);

   DCL GU   CHAR(4) INIT('GU  ');
   DCL GHU  CHAR(4) INIT('GHU ');
   DCL REPL CHAR(4) INIT('REPL');
   DCL ISRT CHAR(4) INIT('ISRT');
   DCL CHNG CHAR(4) INIT('CHNG');
   DCL PURG CHAR(4) INIT('PURG');
   DCL PLITDLI EXTERNAL ENTRY OPTIONS(ASM INTER);

   /******************************************************************/
   /* MAIN PROCESSING                                                */
   /******************************************************************/
   WS_ERR_FLG = 'N';
   WS_RETURN_MSG = ' ';

   CALL PLITDLI(GU, IO_PCB_PTR, INPUT_MSG);
   CARDDEMO_COMMAREA = IN_COMMAREA;

   IF CDEMO_PGM_CONTEXT = '0' THEN DO;
     CDEMO_PGM_CONTEXT = '1';
     OUT_INFOMSG = 'Enter account ID to update';
     CALL SEND_MAP;
   END;
   ELSE DO;
     CALL PROCESS_INPUTS;
   END;

   RETURN;

   /******************************************************************/
   /* PROCESS_INPUTS - Validate and process account update           */
   /******************************************************************/
   PROCESS_INPUTS: PROC;
     IF IN_ACCTID = ' ' | IN_ACCTID = '' THEN DO;
       WS_ERR_FLG = 'Y';
       WS_RETURN_MSG = 'Account number not provided';
       CALL SEND_MAP;
       RETURN;
     END;

     IF VERIFY(IN_ACCTID, '0123456789 ') ^= 0 THEN DO;
       WS_ERR_FLG = 'Y';
       WS_RETURN_MSG = 'Account number must be a non zero 11 digit number';
       CALL SEND_MAP;
       RETURN;
     END;

     /* Read account with hold for update */
     ACCT_SSA = 'ACCTSEG (ACCTID  =' || IN_ACCTID || ')';
     CALL PLITDLI(GHU, DB_ACCT_PTR, ACCOUNT_RECORD, ACCT_SSA);

     IF ACCT_STATUS ^= '  ' THEN DO;
       WS_ERR_FLG = 'Y';
       WS_RETURN_MSG = 'Account not found in master file';
       CALL SEND_MAP;
       RETURN;
     END;

     /* Validate and apply updates */
     CALL VALIDATE_AND_UPDATE;

     IF WS_ERR_FLG = 'Y' THEN DO;
       CALL SEND_MAP;
       RETURN;
     END;

     /* Replace the account segment */
     CALL PLITDLI(REPL, DB_ACCT_PTR, ACCOUNT_RECORD);

     IF ACCT_STATUS = '  ' THEN
       WS_RETURN_MSG = 'Account updated successfully';
     ELSE DO;
       WS_ERR_FLG = 'Y';
       WS_RETURN_MSG = 'Error updating account record';
     END;

     /* Read customer for update if customer fields changed */
     IF WS_DATA_CHANGED = 'Y' THEN DO;
       CXREF_SSA = 'CXREFSEG(ACCTID  =' || IN_ACCTID || ')';
       CALL PLITDLI(GU, DB_CXREF_PTR, CARD_XREF_RECORD, CXREF_SSA);

       IF CXREF_STATUS = '  ' THEN DO;
         CUST_SSA = 'CUSTSEG (CUSTID  =' || XREF_CUST_ID || ')';
         CALL PLITDLI(GHU, DB_CUST_PTR, CUSTOMER_RECORD, CUST_SSA);

         IF CUST_STATUS = '  ' THEN DO;
           IF IN_FNAME ^= ' ' THEN CUST_FIRST_NAME = IN_FNAME;
           IF IN_LNAME ^= ' ' THEN CUST_LAST_NAME = IN_LNAME;
           IF IN_ADDR1 ^= ' ' THEN CUST_ADDR_LINE_1 = IN_ADDR1;
           IF IN_ADDR2 ^= ' ' THEN CUST_ADDR_LINE_2 = IN_ADDR2;
           IF IN_STCD  ^= ' ' THEN CUST_ADDR_STATE_CD = IN_STCD;
           IF IN_ZIP   ^= ' ' THEN CUST_ADDR_ZIP = IN_ZIP;
           IF IN_PHONE1 ^= ' ' THEN CUST_PHONE_NUM_1 = IN_PHONE1;
           IF IN_PHONE2 ^= ' ' THEN CUST_PHONE_NUM_2 = IN_PHONE2;

           CALL PLITDLI(REPL, DB_CUST_PTR, CUSTOMER_RECORD);
         END;
       END;
     END;

     CALL SEND_MAP;
   END PROCESS_INPUTS;

   /******************************************************************/
   /* VALIDATE_AND_UPDATE                                            */
   /******************************************************************/
   VALIDATE_AND_UPDATE: PROC;
     WS_DATA_CHANGED = 'N';

     IF IN_ACTSTATUS ^= ' ' THEN DO;
       IF IN_ACTSTATUS ^= 'Y' & IN_ACTSTATUS ^= 'N' THEN DO;
         WS_ERR_FLG = 'Y';
         WS_RETURN_MSG = 'Account status must be Y or N';
         RETURN;
       END;
       ACCT_ACTIVE_STATUS = IN_ACTSTATUS;
       WS_DATA_CHANGED = 'Y';
     END;

     IF IN_FNAME ^= ' ' | IN_LNAME ^= ' ' |
        IN_ADDR1 ^= ' ' | IN_STCD ^= ' ' |
        IN_PHONE1 ^= ' ' THEN
       WS_DATA_CHANGED = 'Y';
   END VALIDATE_AND_UPDATE;

   /******************************************************************/
   /* SEND_MAP                                                       */
   /******************************************************************/
   SEND_MAP: PROC;
     CALL POPULATE_HEADER_INFO;
     OUT_ERRMSG = WS_RETURN_MSG;
     OUTPUT_MSG.LL = SIZE(OUTPUT_MSG);
     OUTPUT_MSG.ZZ = 0;
     IO_MOD = 'COACTUP';
     CALL PLITDLI(ISRT, IO_PCB_PTR, OUTPUT_MSG);
   END SEND_MAP;

   /******************************************************************/
   /* POPULATE_HEADER_INFO                                           */
   /******************************************************************/
   POPULATE_HEADER_INFO: PROC;
     DCL CURRENT_TS CHAR(17);
     CURRENT_TS = DATETIME();
     OUT_TRNNAME = WS_TRANID;
     OUT_TITLE01 = CCDA_TITLE01;
     OUT_TITLE02 = CCDA_TITLE02;
     OUT_PGMNAME = WS_PGMNAME;
     OUT_CURDATE = SUBSTR(CURRENT_TS, 5, 2) || '/' ||
                   SUBSTR(CURRENT_TS, 7, 2) || '/' ||
                   SUBSTR(CURRENT_TS, 3, 2);
     OUT_CURTIME = SUBSTR(CURRENT_TS, 9, 2) || ':' ||
                   SUBSTR(CURRENT_TS, 11, 2) || ':' ||
                   SUBSTR(CURRENT_TS, 13, 2);
   END POPULATE_HEADER_INFO;

 END COACTUPC;
