 /*********************************************************************/
 /* Program     : COADM01C.PLI                                        */
 /* Application : CardDemo                                            */
 /* Type        : IMS PL/I Program                                    */
 /* Function    : Admin Menu for Administrator users                  */
 /* Converted from COBOL/CICS: app/cbl/COADM01C.cbl                  */
 /*********************************************************************/
 /* Copyright Amazon.com, Inc. or its affiliates.                     */
 /* All Rights Reserved.                                              */
 /* Licensed under the Apache License, Version 2.0                    */
 /*********************************************************************/

 COADM01C: PROC(IO_PCB_PTR, ALT_PCB_PTR) OPTIONS(MAIN);

   DCL IO_PCB_PTR    POINTER;
   DCL ALT_PCB_PTR   POINTER;

   DCL 1 IO_PCB BASED(IO_PCB_PTR),
         2 IO_LTERM    CHAR(8),
         2 IO_RESV     CHAR(2),
         2 IO_STATUS   CHAR(2),
         2 IO_DATE     FIXED BIN(31),
         2 IO_TIME     FIXED BIN(31),
         2 IO_SEQ      FIXED BIN(31),
         2 IO_MOD      CHAR(8);

   DCL 1 ALT_PCB BASED(ALT_PCB_PTR),
         2 ALT_DEST    CHAR(8),
         2 ALT_RESV    CHAR(2),
         2 ALT_STATUS  CHAR(2);

   DCL WS_PGMNAME     CHAR(8) INIT('COADM01C');
   DCL WS_TRANID      CHAR(4) INIT('CA00');
   DCL WS_MESSAGE      CHAR(80) INIT(' ');
   DCL WS_ERR_FLG      CHAR(1) INIT('N');
   DCL WS_OPTION        FIXED BIN(15) INIT(0);
   DCL WS_IDX           FIXED BIN(15);

   %INCLUDE COCOM01Y;
   %INCLUDE COADM02Y;
   %INCLUDE COTTL01Y;
   %INCLUDE CSDAT01Y;
   %INCLUDE CSMSG01Y;

   DCL 1 INPUT_MSG,
         2 LL           FIXED BIN(15),
         2 ZZ           FIXED BIN(15),
         2 TRANCODE     CHAR(8),
         2 IN_OPTION    CHAR(2),
         2 IN_COMMAREA  CHAR(LENGTH(CARDDEMO_COMMAREA));

   DCL 1 OUTPUT_MSG,
         2 LL           FIXED BIN(15),
         2 ZZ           FIXED BIN(15),
         2 OUT_TRNNAME  CHAR(4),
         2 OUT_TITLE01  CHAR(40),
         2 OUT_CURDATE  CHAR(8),
         2 OUT_PGMNAME  CHAR(8),
         2 OUT_TITLE02  CHAR(40),
         2 OUT_CURTIME  CHAR(8),
         2 OUT_OPTION   CHAR(2),
         2 OUT_OPTN(9)  CHAR(40),
         2 OUT_ERRMSG   CHAR(78);

   DCL GU   CHAR(4) INIT('GU  ');
   DCL ISRT CHAR(4) INIT('ISRT');
   DCL CHNG CHAR(4) INIT('CHNG');
   DCL PURG CHAR(4) INIT('PURG');
   DCL PLITDLI EXTERNAL ENTRY OPTIONS(ASM INTER);

   /******************************************************************/
   /* MAIN PROCESSING                                                */
   /******************************************************************/
   WS_ERR_FLG = 'N';
   WS_MESSAGE = ' ';

   CALL PLITDLI(GU, IO_PCB_PTR, INPUT_MSG);

   IF IO_STATUS ^= '  ' & IO_STATUS ^= 'QC' THEN DO;
     CALL RETURN_TO_SIGNON;
     RETURN;
   END;

   CARDDEMO_COMMAREA = IN_COMMAREA;

   IF CDEMO_PGM_CONTEXT = '0' THEN DO;
     CDEMO_PGM_CONTEXT = '1';
     CALL SEND_ADMIN_SCREEN;
   END;
   ELSE DO;
     CALL PROCESS_ENTER_KEY;
   END;

   RETURN;

   /******************************************************************/
   /* PROCESS_ENTER_KEY                                              */
   /******************************************************************/
   PROCESS_ENTER_KEY: PROC;
     DCL OPT_NUM FIXED BIN(15);

     IF VERIFY(IN_OPTION, '0123456789 ') ^= 0 THEN DO;
       WS_ERR_FLG = 'Y';
       WS_MESSAGE = 'Please enter a valid option number...';
       CALL SEND_ADMIN_SCREEN;
       RETURN;
     END;

     OPT_NUM = IN_OPTION;
     IF OPT_NUM < 1 | OPT_NUM > CDEMO_ADMIN_OPT_COUNT THEN DO;
       WS_ERR_FLG = 'Y';
       WS_MESSAGE = 'Please enter a valid option number...';
       CALL SEND_ADMIN_SCREEN;
       RETURN;
     END;

     CDEMO_FROM_TRANID = WS_TRANID;
     CDEMO_FROM_PROGRAM = WS_PGMNAME;
     CDEMO_PGM_CONTEXT = '0';

     CALL PLITDLI(CHNG, ALT_PCB_PTR,
                  CDEMO_ADMIN_OPT_PGMNAME(OPT_NUM));
     CALL PLITDLI(ISRT, ALT_PCB_PTR, CARDDEMO_COMMAREA);
     CALL PLITDLI(PURG, ALT_PCB_PTR);
   END PROCESS_ENTER_KEY;

   RETURN_TO_SIGNON: PROC;
     CALL PLITDLI(CHNG, ALT_PCB_PTR, 'CC00');
     CALL PLITDLI(ISRT, ALT_PCB_PTR, CARDDEMO_COMMAREA);
     CALL PLITDLI(PURG, ALT_PCB_PTR);
   END RETURN_TO_SIGNON;

   SEND_ADMIN_SCREEN: PROC;
     CALL POPULATE_HEADER_INFO;
     CALL BUILD_ADMIN_OPTIONS;
     OUT_ERRMSG = WS_MESSAGE;
     OUTPUT_MSG.LL = SIZE(OUTPUT_MSG);
     OUTPUT_MSG.ZZ = 0;
     IO_MOD = 'COADM01';
     CALL PLITDLI(ISRT, IO_PCB_PTR, OUTPUT_MSG);
   END SEND_ADMIN_SCREEN;

   POPULATE_HEADER_INFO: PROC;
     DCL CURRENT_TS CHAR(17);
     CURRENT_TS = DATETIME();
     OUT_TRNNAME = WS_TRANID;
     OUT_TITLE01 = CCDA_TITLE01;
     OUT_TITLE02 = CCDA_TITLE02;
     OUT_PGMNAME = WS_PGMNAME;
     OUT_CURDATE = SUBSTR(CURRENT_TS, 5, 2) || '/' ||
                   SUBSTR(CURRENT_TS, 7, 2) || '/' ||
                   SUBSTR(CURRENT_TS, 3, 2);
     OUT_CURTIME = SUBSTR(CURRENT_TS, 9, 2) || ':' ||
                   SUBSTR(CURRENT_TS, 11, 2) || ':' ||
                   SUBSTR(CURRENT_TS, 13, 2);
   END POPULATE_HEADER_INFO;

   BUILD_ADMIN_OPTIONS: PROC;
     DO WS_IDX = 1 TO CDEMO_ADMIN_OPT_COUNT;
       OUT_OPTN(WS_IDX) = CDEMO_ADMIN_OPT_NUM(WS_IDX) || '. ' ||
                           CDEMO_ADMIN_OPT_NAME(WS_IDX);
     END;
   END BUILD_ADMIN_OPTIONS;

 END COADM01C;
