 /*********************************************************************/
 /* Program     : COUSR02C.PLI                                        */
 /* Application : CardDemo                                            */
 /* Type        : IMS PL/I Program                                    */
 /* Function    : Update User                                         */
 /* Converted from COBOL/CICS: app/cbl/COUSR02C.cbl                  */
 /*********************************************************************/
 /* Copyright Amazon.com, Inc. or its affiliates.                     */
 /* All Rights Reserved.                                              */
 /* Licensed under the Apache License, Version 2.0                    */
 /*********************************************************************/

 COUSR02C: PROC(IO_PCB_PTR, ALT_PCB_PTR,
                 DB_USRSEC_PTR) OPTIONS(MAIN);

   DCL IO_PCB_PTR    POINTER;
   DCL ALT_PCB_PTR   POINTER;
   DCL DB_USRSEC_PTR POINTER;

   DCL 1 IO_PCB BASED(IO_PCB_PTR),
         2 IO_LTERM    CHAR(8),  2 IO_RESV  CHAR(2),
         2 IO_STATUS   CHAR(2),  2 IO_DATE  FIXED BIN(31),
         2 IO_TIME     FIXED BIN(31), 2 IO_SEQ FIXED BIN(31),
         2 IO_MOD      CHAR(8);

   DCL 1 ALT_PCB BASED(ALT_PCB_PTR),
         2 ALT_DEST    CHAR(8),  2 ALT_RESV  CHAR(2),
         2 ALT_STATUS  CHAR(2);

   DCL 1 DB_USRSEC BASED(DB_USRSEC_PTR),
         2 USRSEC_DBNAME  CHAR(8),  2 USRSEC_LEVEL  CHAR(2),
         2 USRSEC_STATUS  CHAR(2),  2 USRSEC_PROC   CHAR(4),
         2 USRSEC_RESV    FIXED BIN(31),
         2 USRSEC_SEGNAME CHAR(8),  2 USRSEC_KEYLEN FIXED BIN(31),
         2 USRSEC_SENSEG  FIXED BIN(31),
         2 USRSEC_KEYVAL  CHAR(256);

   DCL WS_PGMNAME     CHAR(8) INIT('COUSR02C');
   DCL WS_TRANID      CHAR(4) INIT('CU02');
   DCL WS_ERR_FLG      CHAR(1) INIT('N');
   DCL WS_RETURN_MSG   CHAR(75) INIT(' ');

   %INCLUDE COCOM01Y;
   %INCLUDE COTTL01Y;
   %INCLUDE CSDAT01Y;
   %INCLUDE CSMSG01Y;
   %INCLUDE CSUSR01Y;

   DCL 1 INPUT_MSG,
         2 LL           FIXED BIN(15),
         2 ZZ           FIXED BIN(15),
         2 TRANCODE     CHAR(8),
         2 IN_USERID    CHAR(8),
         2 IN_FNAME     CHAR(20),
         2 IN_LNAME     CHAR(20),
         2 IN_PASSWD    CHAR(8),
         2 IN_UTYPE     CHAR(1),
         2 IN_COMMAREA  CHAR(LENGTH(CARDDEMO_COMMAREA));

   DCL 1 OUTPUT_MSG,
         2 LL           FIXED BIN(15),
         2 ZZ           FIXED BIN(15),
         2 OUT_TRNNAME  CHAR(4),
         2 OUT_TITLE01  CHAR(40),
         2 OUT_CURDATE  CHAR(8),
         2 OUT_PGMNAME  CHAR(8),
         2 OUT_TITLE02  CHAR(40),
         2 OUT_CURTIME  CHAR(8),
         2 OUT_USERID   CHAR(8),
         2 OUT_FNAME    CHAR(20),
         2 OUT_LNAME    CHAR(20),
         2 OUT_PASSWD   CHAR(8),
         2 OUT_UTYPE    CHAR(1),
         2 OUT_INFOMSG  CHAR(40),
         2 OUT_ERRMSG   CHAR(78);

   DCL USRSEC_SSA CHAR(40);

   DCL GU   CHAR(4) INIT('GU  ');
   DCL GHU  CHAR(4) INIT('GHU ');
   DCL REPL CHAR(4) INIT('REPL');
   DCL ISRT CHAR(4) INIT('ISRT');
   DCL CHNG CHAR(4) INIT('CHNG');
   DCL PURG CHAR(4) INIT('PURG');
   DCL PLITDLI EXTERNAL ENTRY OPTIONS(ASM INTER);

   /******************************************************************/
   /* MAIN PROCESSING                                                */
   /******************************************************************/
   WS_ERR_FLG = 'N';
   WS_RETURN_MSG = ' ';

   CALL PLITDLI(GU, IO_PCB_PTR, INPUT_MSG);
   CARDDEMO_COMMAREA = IN_COMMAREA;

   /* If user ID passed from calling program */
   IF CDEMO_USER_ID ^= '' & CDEMO_USER_ID ^= ' ' THEN
     IN_USERID = CDEMO_USER_ID;

   IF CDEMO_PGM_CONTEXT = '0' THEN DO;
     CDEMO_PGM_CONTEXT = '1';
     IF IN_USERID ^= ' ' THEN
       CALL DISPLAY_USER;
     ELSE
       OUT_INFOMSG = 'Enter User ID to update';
     CALL SEND_MAP;
   END;
   ELSE DO;
     CALL PROCESS_UPDATE;
   END;

   RETURN;

   /******************************************************************/
   /* DISPLAY_USER                                                   */
   /******************************************************************/
   DISPLAY_USER: PROC;
     USRSEC_SSA = 'USRSEG  (USRID   =' || IN_USERID || ')';
     CALL PLITDLI(GU, DB_USRSEC_PTR, SEC_USER_DATA, USRSEC_SSA);

     IF USRSEC_STATUS = '  ' THEN DO;
       OUT_USERID = SEC_USR_ID;
       OUT_FNAME  = SEC_USR_FNAME;
       OUT_LNAME  = SEC_USR_LNAME;
       OUT_PASSWD = SEC_USR_PWD;
       OUT_UTYPE  = SEC_USR_TYPE;
       OUT_INFOMSG = 'Update fields and press Enter';
     END;
     ELSE DO;
       WS_ERR_FLG = 'Y';
       WS_RETURN_MSG = 'User not found';
     END;
   END DISPLAY_USER;

   /******************************************************************/
   /* PROCESS_UPDATE                                                 */
   /******************************************************************/
   PROCESS_UPDATE: PROC;
     IF IN_USERID = ' ' THEN DO;
       WS_RETURN_MSG = 'User ID is required';
       CALL SEND_MAP;
       RETURN;
     END;

     /* Read with hold for update */
     USRSEC_SSA = 'USRSEG  (USRID   =' || IN_USERID || ')';
     CALL PLITDLI(GHU, DB_USRSEC_PTR, SEC_USER_DATA, USRSEC_SSA);

     IF USRSEC_STATUS ^= '  ' THEN DO;
       WS_RETURN_MSG = 'User not found for update';
       CALL SEND_MAP;
       RETURN;
     END;

     /* Apply updates */
     IF IN_FNAME ^= ' ' THEN SEC_USR_FNAME = IN_FNAME;
     IF IN_LNAME ^= ' ' THEN SEC_USR_LNAME = IN_LNAME;
     IF IN_PASSWD ^= ' ' THEN SEC_USR_PWD = IN_PASSWD;
     IF IN_UTYPE = 'A' | IN_UTYPE = 'U' THEN
       SEC_USR_TYPE = IN_UTYPE;

     /* Replace the segment */
     CALL PLITDLI(REPL, DB_USRSEC_PTR, SEC_USER_DATA);

     IF USRSEC_STATUS = '  ' THEN
       WS_RETURN_MSG = 'User updated successfully';
     ELSE
       WS_RETURN_MSG = 'Error updating user';

     CALL DISPLAY_USER;
     CALL SEND_MAP;
   END PROCESS_UPDATE;

   SEND_MAP: PROC;
     CALL POPULATE_HEADER_INFO;
     OUT_ERRMSG = WS_RETURN_MSG;
     OUTPUT_MSG.LL = SIZE(OUTPUT_MSG);
     OUTPUT_MSG.ZZ = 0;
     IO_MOD = 'COUSR02';
     CALL PLITDLI(ISRT, IO_PCB_PTR, OUTPUT_MSG);
   END SEND_MAP;

   POPULATE_HEADER_INFO: PROC;
     DCL CURRENT_TS CHAR(17);
     CURRENT_TS = DATETIME();
     OUT_TRNNAME = WS_TRANID;
     OUT_TITLE01 = CCDA_TITLE01;
     OUT_TITLE02 = CCDA_TITLE02;
     OUT_PGMNAME = WS_PGMNAME;
     OUT_CURDATE = SUBSTR(CURRENT_TS, 5, 2) || '/' ||
                   SUBSTR(CURRENT_TS, 7, 2) || '/' ||
                   SUBSTR(CURRENT_TS, 3, 2);
     OUT_CURTIME = SUBSTR(CURRENT_TS, 9, 2) || ':' ||
                   SUBSTR(CURRENT_TS, 11, 2) || ':' ||
                   SUBSTR(CURRENT_TS, 13, 2);
   END POPULATE_HEADER_INFO;

 END COUSR02C;
