 /*********************************************************************/
 /* Unused data structure (placeholder)                               */
 /* Converted from COBOL copybook: app/cpy/UNUSED1Y.cpy              */
 /*********************************************************************/

 DCL 1 UNUSED_DATA,
       2 UNUSED_ID              CHAR(8),
       2 UNUSED_FNAME           CHAR(20),
       2 UNUSED_LNAME           CHAR(20),
       2 UNUSED_PWD             CHAR(8),
       2 UNUSED_TYPE            CHAR(1),
       2 UNUSED_FILLER          CHAR(23);
