***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    DBD for Customer Data File (CUSTDAT)
*    Original CICS VSAM KSDS: AWS.M2.CARDDEMO.CUSTDATA.VSAM.KSDS
*    Key: CUST-ID (9 bytes, numeric)
*    Record length: 500 bytes
***********************************************************************
         TITLE   'ASSEMBLE OF DBDNAME=DBCUSTDT'
       DBD     NAME=DBCUSTDT,ACCESS=(HIDAM,VSAM),PASSWD=NO,            C
               EXIT=(*,KEY,DATA,NOPATH,(NOCASCADE),LOG),               C
               VERSION=
***********************************************************************
*        DATASET GROUP NUMBER 1                                       *
***********************************************************************
DSG001 DATASET DD1=DDCUSTDT,SIZE=(4096),SCAN=3
***********************************************************************
*        SEGMENT NUMBER 1 - ROOT, CUSTOMER DATA RECORD               *
***********************************************************************
       SEGM    NAME=CUSTSEG0,PARENT=0,BYTES=500,RULES=(,HERE),        X
               POINTER=(TWINBWD)
       FIELD   NAME=(CUSTID,SEQ,U),START=1,BYTES=9,TYPE=C
***********************************************************************
       DBDGEN
       FINISH
       END
