***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    DBD for Card Cross-Reference Secondary Index
*    Secondary index on XREF-ACCT-ID for DBCXREF
*    Allows lookup of cross-reference records by account number
***********************************************************************
         TITLE   'ASSEMBLE OF DBDNAME=DBCXRIDX'
       DBD     NAME=DBCXRIDX,ACCESS=(INDEX,VSAM,PROT),PASSWD=NO,       X
               VERSION=
***********************************************************************
*        DATASET GROUP NUMBER 1                                       *
***********************************************************************
DSG001 DATASET DD1=DDCXRIDX,SIZE=(4096)
***********************************************************************
*        SEGMENT NUMBER 1                                             *
***********************************************************************
       SEGM    NAME=XREFINDX,PARENT=0,BYTES=11,                        X
               FREQ=100000
       FIELD   NAME=(INDXSEQ,SEQ,U),START=1,BYTES=11,TYPE=C
       LCHILD  NAME=(XREFSEG0,DBCXREF),                                X
               INDEX=XREFACCT
       DBDGEN
       FINISH
       END
