***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    DBD for Transaction File (TRANSACT)
*    Original CICS VSAM KSDS: AWS.M2.CARDDEMO.TRANSACT.VSAM.KSDS
*    Key: TRAN-ID (16 bytes, character)
*    Record length: 350 bytes
***********************************************************************
         TITLE   'ASSEMBLE OF DBDNAME=DBTRANSC'
       DBD     NAME=DBTRANSC,ACCESS=(HIDAM,VSAM),PASSWD=NO,            C
               EXIT=(*,KEY,DATA,NOPATH,(NOCASCADE),LOG),               C
               VERSION=
***********************************************************************
*        DATASET GROUP NUMBER 1                                       *
***********************************************************************
DSG001 DATASET DD1=DDTRANSC,SIZE=(4096),SCAN=3
***********************************************************************
*        SEGMENT NUMBER 1 - ROOT, TRANSACTION RECORD                 *
***********************************************************************
       SEGM    NAME=TRANSEG0,PARENT=0,BYTES=350,RULES=(,HERE),        X
               POINTER=(TWINBWD)
       FIELD   NAME=(TRANID,SEQ,U),START=1,BYTES=16,TYPE=C
***********************************************************************
       DBDGEN
       FINISH
       END
