***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    DBD for User Security File (USRSEC)
*    Original CICS VSAM KSDS: AWS.M2.CARDDEMO.USRSEC.VSAM.KSDS
*    Key: SEC-USR-ID (8 bytes, character)
*    Record length: 80 bytes
***********************************************************************
         TITLE   'ASSEMBLE OF DBDNAME=DBUSRSEC'
       DBD     NAME=DBUSRSEC,ACCESS=(HIDAM,VSAM),PASSWD=NO,            C
               EXIT=(*,KEY,DATA,NOPATH,(NOCASCADE),LOG),               C
               VERSION=
***********************************************************************
*        DATASET GROUP NUMBER 1                                       *
***********************************************************************
DSG001 DATASET DD1=DDUSRSEC,SIZE=(4096),SCAN=3
***********************************************************************
*        SEGMENT NUMBER 1 - ROOT, USER SECURITY RECORD               *
***********************************************************************
       SEGM    NAME=USRSEG0,PARENT=0,BYTES=80,RULES=(,HERE),          X
               POINTER=(TWINBWD)
       FIELD   NAME=(USRID,SEQ,U),START=1,BYTES=8,TYPE=C
***********************************************************************
       DBDGEN
       FINISH
       END
