***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    PSB for COACTUPP - Account Update
*    Needs: IO PCB, ALT PCB, ACCTDAT, CARDDAT, CUSTDAT, CXREF DB PCBs
***********************************************************************
         PCB   TYPE=TP,MODIFY=YES,EXPRESS=YES
         PCB   TYPE=TP,MODIFY=YES,ALTER=YES
ACCTPCB  PCB   TYPE=DB,DBDNAME=DBACCTDT,PROCOPT=AP,KEYLEN=11
         SENSEG  NAME=ACCTSEG0,PARENT=0
CARDPCB  PCB   TYPE=DB,DBDNAME=DBCARDDT,PROCOPT=AP,KEYLEN=16
         SENSEG  NAME=CARDSEG0,PARENT=0
CUSTPCB  PCB   TYPE=DB,DBDNAME=DBCUSTDT,PROCOPT=AP,KEYLEN=9
         SENSEG  NAME=CUSTSEG0,PARENT=0
XREFPCB  PCB   TYPE=DB,DBDNAME=DBCXREF,PROCOPT=AP,KEYLEN=16
         SENSEG  NAME=XREFSEG0,PARENT=0
XAIXPCB  PCB   TYPE=DB,DBDNAME=DBCXREF,PROCOPT=G,KEYLEN=11,           X
               PROCSEQD=DBCXRIDX
         SENSEG  NAME=XREFSEG0,PARENT=0
         PSBGEN  LANG=PLI,PSBNAME=PCOACTUP,CMPAT=YES
         END
