***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    PSB for COMEN01P - Main Menu (Regular User)
*    Needs: IO PCB, ALT PCB (for ISRT to switch to other programs)
***********************************************************************
         PCB   TYPE=TP,MODIFY=YES,EXPRESS=YES
         PCB   TYPE=TP,MODIFY=YES,ALTER=YES
         PSBGEN  LANG=PLI,PSBNAME=PCOMEN01,CMPAT=YES
         END
