***********************************************************************
* Copyright Amazon.com, Inc. or its affiliates.
* All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License").
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing,
* software distributed under the License is distributed on an
* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
* either express or implied. See the License for the specific
* language governing permissions and limitations under the License
***********************************************************************
*    PSB for COTRN01P - Transaction View
*    Needs: IO PCB, ALT PCB, TRANSACT, CARDDAT DB PCBs
***********************************************************************
         PCB   TYPE=TP,MODIFY=YES,EXPRESS=YES
         PCB   TYPE=TP,MODIFY=YES,ALTER=YES
TRANPCB  PCB   TYPE=DB,DBDNAME=DBTRANSC,PROCOPT=G,KEYLEN=16
         SENSEG  NAME=TRANSEG0,PARENT=0
CARDPCB  PCB   TYPE=DB,DBDNAME=DBCARDDT,PROCOPT=G,KEYLEN=16
         SENSEG  NAME=CARDSEG0,PARENT=0
         PSBGEN  LANG=PLI,PSBNAME=PCOTRN01,CMPAT=YES
         END
