//PLICOMP  JOB (CARDDEMO),'PLI COMPILE AND LINK',
//         CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
//         NOTIFY=&SYSUID
//*********************************************************************
//* JCL       : PLICOMP.JCL
//* Application: CardDemo
//* Function  : Compile and link-edit all PL/I programs for IMS
//*             Uses IBM Enterprise PL/I compiler
//*********************************************************************
//* Copyright Amazon.com, Inc. or its affiliates.
//* All Rights Reserved.
//* Licensed under the Apache License, Version 2.0
//*********************************************************************
//*
//* PROC for PL/I compile + link with IMS
//*
//PLICLG   PROC MBR=,
//         LMOD=,
//         PLIPARM='OBJECT,NODECK,SOURCE,LIST,XREF,AGGREGATE'
//*
//PLI      EXEC PGM=IBMZPLI,
//         PARM='&PLIPARM'
//STEPLIB  DD DSN=CEE.SCEERUN,DISP=SHR
//         DD DSN=PLI.SIBMZCMP,DISP=SHR
//SYSLIB   DD DSN=CARDDEMO.PLI.INCLUDE,DISP=SHR
//         DD DSN=IMS.SDFSMAC,DISP=SHR
//SYSIN    DD DSN=CARDDEMO.PLI.SOURCE(&MBR),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD DSN=&&OBJMOD,DISP=(NEW,PASS),
//         UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//*
//LKED     EXEC PGM=IEWL,
//         PARM='LIST,LET,XREF,MAP',
//         COND=(8,LT,PLI)
//SYSLIB   DD DSN=CEE.SCEELKED,DISP=SHR
//         DD DSN=IMS.SDFSRESL,DISP=SHR
//         DD DSN=PLI.SIBMZMOD,DISP=SHR
//SYSLIN   DD DSN=&&OBJMOD,DISP=(OLD,DELETE)
//         DD *
 INCLUDE SYSLIB(DFSLI000)
 NAME &LMOD(R)
/*
//SYSLMOD  DD DSN=CARDDEMO.PLI.LOADLIB(&LMOD),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//*
//         PEND
//*
//*-------------------------------------------------------------------
//* Compile Online Programs
//*-------------------------------------------------------------------
//COSGN00  EXEC PLICLG,MBR=COSGN00C,LMOD=COSGN00C
//COMEN01  EXEC PLICLG,MBR=COMEN01C,LMOD=COMEN01C
//COADM01  EXEC PLICLG,MBR=COADM01C,LMOD=COADM01C
//COACTVW  EXEC PLICLG,MBR=COACTVWC,LMOD=COACTVWC
//COACTUP  EXEC PLICLG,MBR=COACTUPC,LMOD=COACTUPC
//COCRDLI  EXEC PLICLG,MBR=COCRDLIC,LMOD=COCRDLIC
//COCRDSL  EXEC PLICLG,MBR=COCRDSLC,LMOD=COCRDSLC
//COCRDUP  EXEC PLICLG,MBR=COCRDUPC,LMOD=COCRDUPC
//COTRN00  EXEC PLICLG,MBR=COTRN00C,LMOD=COTRN00C
//COTRN01  EXEC PLICLG,MBR=COTRN01C,LMOD=COTRN01C
//COTRN02  EXEC PLICLG,MBR=COTRN02C,LMOD=COTRN02C
//CORPT00  EXEC PLICLG,MBR=CORPT00C,LMOD=CORPT00C
//COBIL00  EXEC PLICLG,MBR=COBIL00C,LMOD=COBIL00C
//COUSR00  EXEC PLICLG,MBR=COUSR00C,LMOD=COUSR00C
//COUSR01  EXEC PLICLG,MBR=COUSR01C,LMOD=COUSR01C
//COUSR02  EXEC PLICLG,MBR=COUSR02C,LMOD=COUSR02C
//COUSR03  EXEC PLICLG,MBR=COUSR03C,LMOD=COUSR03C
//*
//*-------------------------------------------------------------------
//* Compile Batch Programs
//*-------------------------------------------------------------------
//CBTRN01  EXEC PLICLG,MBR=CBTRN01C,LMOD=CBTRN01C
//CBTRN02  EXEC PLICLG,MBR=CBTRN02C,LMOD=CBTRN02C
//CBTRN03  EXEC PLICLG,MBR=CBTRN03C,LMOD=CBTRN03C
//CBACT01  EXEC PLICLG,MBR=CBACT01C,LMOD=CBACT01C
//CBACT02  EXEC PLICLG,MBR=CBACT02C,LMOD=CBACT02C
//CBACT03  EXEC PLICLG,MBR=CBACT03C,LMOD=CBACT03C
//CBACT04  EXEC PLICLG,MBR=CBACT04C,LMOD=CBACT04C
//CBSTM3A  EXEC PLICLG,MBR=CBSTM03A,LMOD=CBSTM03A
//CBSTM3B  EXEC PLICLG,MBR=CBSTM03B,LMOD=CBSTM03B
//CBCUS01  EXEC PLICLG,MBR=CBCUS01C,LMOD=CBCUS01C
//CBEXPRT  EXEC PLICLG,MBR=CBEXPORT,LMOD=CBEXPORT
//CBIMPRT  EXEC PLICLG,MBR=CBIMPORT,LMOD=CBIMPORT
//CBSWAIT  EXEC PLICLG,MBR=COBSWAIT,LMOD=COBSWAIT
